---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Architecture.ContinuousRail
source: html/58fed99e-85b1-f626-4b6e-9f668a8be42c.htm
---
# ContinuousRail Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.